"""Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения
задачи функцию `count`"""

s = "A country is not a territory, nor a political regime, it is a people"

print("В строке слов:", s.count(" ") + 1)