"""
В школе решили набрать три новых математических класса.
Так как занятия по математике у них проходят в одно и то же время,
было решено выделить кабинет для каждого класса и купить в них новые парты.
За каждой партой может сидеть не больше двух учеников. Известно количество учащихся в каждом из трёх классов.
Сколько всего нужно закупить парт чтобы их хватило на всех учеников?
Программа получает на вход три натуральных числа: количество учащихся в каждом из трех классов.
"""

class_a = int(input('Введите количество учеников в классе А: '))

class_b = int(input('Введите количество учеников в классе B: '))

class_c = int(input('Введите количество учеников в классе C: '))


print('Класс А:', class_a)
print('Класс В:', class_b)
print('Класс С:', class_c)

